[
  { 
    "text": "Barangsiapa menempuh jalan untuk mencari ilmu, Allah akan mudahkan baginya jalan ke surga.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Amal itu tergantung pada niatnya.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Mukmin yang kuat lebih baik dan lebih dicintai Allah daripada mukmin yang lemah.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Sebaik-baik kalian adalah yang belajar Al-Qur'an dan mengajarkannya.", 
    "source": "HR. Bukhari" 
  },
  { 
    "text": "Sampaikan dariku walau satu ayat.", 
    "source": "HR. Bukhari" 
  },
  { 
    "text": "Agama adalah nasihat.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Tidak beriman seseorang sampai ia mencintai saudaranya seperti mencintai dirinya sendiri.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Sesungguhnya Allah tidak melihat rupa dan harta kalian, tetapi melihat hati dan amal kalian.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Orang yang paling dicintai Allah adalah yang paling bermanfaat bagi manusia.", 
    "source": "HR. Thabrani" 
  },
  { 
    "text": "Tebarkanlah salam di antara kalian.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Tangan di atas lebih baik daripada tangan di bawah.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Allah tidak akan menyayangi orang yang tidak menyayangi sesama manusia.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Orang yang menunjuki kepada kebaikan seperti orang yang melakukannya.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Barang siapa beriman kepada Allah dan hari akhir, hendaklah berkata baik atau diam.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Sesungguhnya dunia itu manis dan hijau, dan Allah menjadikan kalian khalifah di dalamnya.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Cintailah orang lain seperti engkau mencintai dirimu sendiri.", 
    "source": "HR. Bukhari" 
  },
  { 
    "text": "Barangsiapa tidak menyayangi, maka tidak akan disayangi.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Sedekah tidak akan mengurangi harta.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Orang kuat bukanlah yang pandai bergulat, melainkan yang dapat menahan amarahnya.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Sesungguhnya Allah mencintai jika salah seorang dari kalian melakukan sesuatu, ia menyempurnakannya.", 
    "source": "HR. Thabrani" 
  },
  { 
    "text": "Senyumanmu untuk saudaramu adalah sedekah.", 
    "source": "HR. Tirmidzi" 
  },
  { 
    "text": "Shalat adalah tiang agama.", 
    "source": "HR. Baihaqi" 
  },
  { 
    "text": "Permudahlah, jangan mempersulit. Berilah kabar gembira, jangan membuat orang lari.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Hendaklah engkau mengatakan yang benar walaupun pahit.", 
    "source": "HR. Ahmad" 
  },
  { 
    "text": "Allah Maha Indah dan menyukai keindahan.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Berpuasalah, niscaya kamu akan sehat.", 
    "source": "HR. Thabrani" 
  },
  { 
    "text": "Sesungguhnya shalat dapat mencegah perbuatan keji dan mungkar.", 
    "source": "QS. Al-Ankabut: 45" 
  },
  { 
    "text": "Tiada suatu amalan yang lebih dicintai Allah pada hari Idul Adha selain menyembelih hewan kurban.", 
    "source": "HR. Tirmidzi" 
  },
  { 
    "text": "Tolonglah saudaramu yang zalim dan yang dizalimi.", 
    "source": "HR. Bukhari" 
  },
  { 
    "text": "Wahai sekalian manusia, tebarkanlah salam, berilah makan, sambunglah silaturahmi, shalatlah saat malam, niscaya kalian masuk surga dengan selamat.", 
    "source": "HR. Tirmidzi" 
  },
  { 
    "text": "Seseorang akan dikumpulkan bersama orang yang ia cintai.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Sesungguhnya di surga ada pintu bernama Ar-Rayyan, yang dimasuki oleh orang-orang yang berpuasa.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Harta tidak akan berkurang karena sedekah.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Tidak akan masuk surga orang yang dalam hatinya terdapat kesombongan sebesar biji sawi.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Kebersihan adalah sebagian dari iman.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Satu dirham yang kamu infakkan di jalan Allah lebih utama daripada seratus ribu dirham.", 
    "source": "HR. Bukhari" 
  },
  { 
    "text": "Tiap sendi dari tubuh harus disedekahi setiap hari.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Yang paling sempurna imannya adalah yang paling baik akhlaknya.", 
    "source": "HR. Tirmidzi" 
  },
  { 
    "text": "Barang siapa memberi kemudahan bagi orang lain, Allah akan mudahkan urusannya di dunia dan akhirat.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Orang yang menipu bukan golongan kami.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Menuntut ilmu itu wajib bagi setiap Muslim.", 
    "source": "HR. Ibnu Majah" 
  },
  { 
    "text": "Setiap kebaikan adalah sedekah.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Hindarilah prasangka, karena prasangka adalah perkataan paling dusta.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Jangan kamu saling mendengki, membenci, dan memutuskan hubungan.", 
    "source": "HR. Bukhari & Muslim" 
  },
  { 
    "text": "Janganlah kamu masuk surga sehingga kamu beriman, dan janganlah kamu beriman sampai kamu saling mencintai.", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Ketakwaan itu di sini (sambil menunjuk ke dada).", 
    "source": "HR. Muslim" 
  },
  { 
    "text": "Orang yang berjalan untuk menolong saudaranya lebih aku cintai daripada beri’tikaf di masjid ini selama sebulan.", 
    "source": "HR. Thabrani" 
  },
  { 
    "text": "Seorang mukmin yang bergaul dengan masyarakat dan bersabar terhadap gangguannya, lebih baik daripada yang tidak bergaul dan tidak bersabar atas gangguan mereka.", 
    "source": "HR. Ahmad" }
]